## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                NAME                 |
|--------|-------------------------------------|
| update | `aws_quicksight_data_set.sms_usage` |
|        | `aws_s3_object.manifest_file`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_quicksight_data_set.sms_usage will be updated in-place
  ~ resource "aws_quicksight_data_set" "sms_usage" {
        id             = "239043911459,sms_usage"
        name           = "SmsUsage"
        tags           = {}
        # (6 unchanged attributes hidden)

      - logical_table_map {
          - alias                = "smsusage" -> null
          - logical_table_map_id = "smsusage" -> null

          - data_transforms {
              - cast_column_type_operation {
                  - column_name     = "PublishTimeUTC" -> null
                  - format          = "yyyy-MM-dd'T'HH:mm:ss.SSSZ" -> null
                  - new_column_type = "DATETIME" -> null
                }
            }
          - data_transforms {
              - cast_column_type_operation {
                  - column_name     = "PriceInUSD" -> null
                  - new_column_type = "DECIMAL" -> null
                }
            }
          - data_transforms {
              - cast_column_type_operation {
                  - column_name     = "PartNumber" -> null
                  - new_column_type = "INTEGER" -> null
                }
            }
          - data_transforms {
              - cast_column_type_operation {
                  - column_name     = "TotalParts" -> null
                  - new_column_type = "INTEGER" -> null
                }
            }
          - data_transforms {
              - project_operation {
                  - projected_columns = [
                      - "PublishTimeUTC",
                      - "MessageId",
                      - "MessageType",
                      - "DeliveryStatus",
                      - "PriceInUSD",
                      - "PartNumber",
                      - "TotalParts",
                    ] -> null
                }
            }

          - source {
              - physical_table_id = "smsusage" -> null
            }
        }
      + logical_table_map {
          + alias                = "smsusage"
          + logical_table_map_id = "smsusage"

          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = "PriceInUSD"
                  + format          = (known after apply)
                  + new_column_type = "DECIMAL"
                }
            }
          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = "PartNumber"
                  + format          = (known after apply)
                  + new_column_type = "INTEGER"
                }
            }
          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = "TotalParts"
                  + format          = (known after apply)
                  + new_column_type = "INTEGER"
                }
            }

          + source {
              + data_set_arn      = (known after apply)
              + physical_table_id = "smsusage"
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_s3_object.manifest_file will be updated in-place
  ~ resource "aws_s3_object" "manifest_file" {
      ~ etag                   = "4f558e8d8cdbbf914a95755cbda61968" -> "221f592f333f2fc284626cfdb8c4bc80"
        id                     = "quicksight/s3-manifest-sms-usage.json"
        tags                   = {}
      + version_id             = (known after apply)
        # (12 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudformation_stack.sms-usage-notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-s3-usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.login_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.users"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.s3_sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.manifest_file"]

38 tests, 19 passed, 19 warnings, 0 failures, 0 exceptions

```

</details>
